[
    {
        "title": "Macaroni Grill Rosemary Bread",
        "yield": "2 loaves",
        "time": "",
        "postId": 107,
        "ingredients": [
            {
                "amount": "2 packets (1.5 tbsp)",
                "name": "active dry yeast"
            },
            {
                "amount": "1 cup",
                "name": "warm water"
            },
            {
                "amount": "1/4 tsp",
                "name": "sugar"
            },
            {
                "amount": "1 1/2 tsp",
                "name": "salt"
            },
            {
                "amount": "3 tbsp",
                "name": "olive oil (I used extra virgin)"
            },
            {
                "amount": "2 3/4 cups",
                "name": "all purpose flour"
            },
            {
                "amount": "1/2 teaspoon",
                "name": "mixed oregano, basil, and garlic powder (equal parts of each to total 1/2 teaspoon)"
            },
            {
                "amount": "1/4 teaspoon",
                "name": "black pepper, cracked"
            },
            {
                "amount": "1 1/2 tbsp",
                "name": "fresh rosemary needles, with stems chopped off"
            },
            {
                "amount": "",
                "name": ""
            },
            {
                "amount": "1",
                "name": "egg"
            },
            {
                "amount": "",
                "name": "butter"
            },
            {
                "amount": "",
                "name": "sea salt"
            }
        ],
        "steps": [
            {
                "description": "Combine in the bottom of your mixer bowl the yeast, warm water, and sugar. Mix it gently with a spoon to incorporate. Let it sit and rise for 5 minutes."
            },
            {
                "description": "Add the salt, olive oil, and 1 cup of the flour. Mix it for about 1 minute on a low setting. Change to your bread hook attachment."
            },
            {
                "description": "Add the remaining flour, 1/2 cup at a time. Once all the flour is in, let your bread hook knead on high in your mixer for 5-7 minutes."
            },
            {
                "description": "While the mixer is working its magic, chop up your rosemary. Mix it with the herbs and pepper so the rosemary is coated in the herbs. Add to the bread dough."
            },
            {
                "description": "Thoroughly wet a clean kitchen rag and put it in the microwave for 30 seconds to heat it up. Place this over the bowl to let the dough rise for 40 minutes, or until doubled in size. No need to put it in a warm oven if the rag is moist and warm. My dough not only doubled, but perhaps tripled. This is fine."
            },
            {
                "description": "Divide the dough in half and place the two balls of dough on a greased cookie sheet or a baking stone sprayed with a bit of olive oil."
            },
            {
                "description": "Beat the egg and brush it on the two dough balls."
            },
            {
                "description": "Place the baking stone with the two loaves in the oven heated up to 175 degrees Fahrenheit. Leave them in the oven for 15 minutes to double in size."
            },
            {
                "description": "With the loaves still inside, turn the oven up to 375 degrees Fahrenheit. From the time you turn the oven up, it should take 20-25 minutes for the loaves to bake."
            },
            {
                "description": "Take the loaves out when they have a nice golden color to the crust. Brush butter on each loaf and sprinkle with sea salt."
            },
            {
                "description": "Eat it while it's hot... if there's any left!"
            }
        ]
    }
]