[
    {
        "title": "Fluffy Homemade Marshmallows  ",
        "yield": "about 100 marshmallows",
        "time": "",
        "postId": 37,
        "ingredients": [
            {
                "amount": "3 (.25 oz) packets",
                "name": "unflavored gelatin (usually a box comes with 4)"
            },
            {
                "amount": "1 cup",
                "name": "cold water, divided"
            },
            {
                "amount": "1 1/2 cups",
                "name": "sugar"
            },
            {
                "amount": "1 cup",
                "name": "light corn syrup"
            },
            {
                "amount": "1/4 tsp",
                "name": "salt"
            },
            {
                "amount": "1 tsp",
                "name": "vanilla extract (or peppermint extract, or any flavor!)"
            },
            {
                "amount": "1/2 cup",
                "name": "powdered sugar"
            },
            {
                "amount": "1/2 cup",
                "name": "cornstarch"
            }
        ],
        "steps": [
            {
                "description": "**Preparing the marshmallows**"
            },
            {
                "description": "Put 1/2 cup of the water into the bottom of a stand mixer fitted with a whisk attachment. Add the packets of gelatin and give it a quick stir."
            },
            {
                "description": "Combine remaining water, sugar, corn syrup, and salt into a small sauce pan over medium-high  heat. Cover and cook for 4 minutes."
            },
            {
                "description": "Uncover the pan and clip a candy thermometer to the side of the pan. Keep cooking until it reaches 240 degrees fahrenheit. It took me about 8-10 minutes. Once it reaches 240 degrees, immediately remove the pan from heat."
            },
            {
                "description": "**Whipping the marshmallows**"
            },
            {
                "description": "With the mixer on a low speed, slowly poor the sugar mixture into the gelatin mixture in the mixer. Once it's all in the mixer, turn the mixer on high speed for 15 minutes, or until the mixture looks like marshmallow creme: white, fluffy, and lukewarm. Add vanilla during the last minute of mixing."
            },
            {
                "description": "**Setting the marshmallows**"
            },
            {
                "description": "Mix the powdered sugar and cornstarch together in a bowl. **Lightly** spray with cooking spray a 9x13 pan (after you spray, it would be good to use a paper towel to remove the excess spray from the pan. You just want a very light layer or it will color the marshmallows yellow!) then dust the pan with the sugar/cornstarch."
            },
            {
                "description": "Spread the marshmallow in the pan to be as even as you can. Then, dust the top with powdered sugar/cornstarch. After you do this, you can pat it more evenly with your hands."
            },
            {
                "description": "**Cutting the marshmallows**"
            },
            {
                "description": "Leave it, uncovered, for at least 4 hours. I left mine overnight. Afterward, cut the marshmallows into cubes. Toss them with powdered sugar/cornstarch to prevent them from getting too sticky."
            },
            {
                "description": "Store them in an airtight container for up to 1 month!"
            }
        ]
    }
]
