[
    {
        "title": "Chewy Chocolate Chip Cookies  ",
        "yield": "3 dozen scrumptious cookies",
        "time": "",
        "postId": 68,
        "ingredients": [
            {
                "amount": "3/4 cup (1.5 sticks)",
                "name": "butter, softened"
            },
            {
                "amount": "3/4 cup",
                "name": "brown sugar"
            },
            {
                "amount": "1/4 cup",
                "name": "sugar"
            },
            {
                "amount": "1",
                "name": "large egg, at room temperature"
            },
            {
                "amount": "2 tsp",
                "name": "vanilla extract"
            },
            {
                "amount": "2 cups",
                "name": "all-purpose flour"
            },
            {
                "amount": "2 tsp",
                "name": "cornstarch"
            },
            {
                "amount": "1 tsp",
                "name": "baking soda"
            },
            {
                "amount": "1/2 tsp",
                "name": "salt"
            },
            {
                "amount": "1 1/2 cups",
                "name": "chocolate chips, (I put Andes Mints in mine, and I've also done crushed up Oreos)"
            }
        ],
        "steps": [
            {
                "description": "In a large bowl, cream butter and sugars until it's light and fluffy. Taste a little. That's the best stuff in the whole world. Mix in the egg and the vanilla and scrape the sides of the bowl as needed."
            },
            {
                "description": "In a separate bowl, combine the dry ingredients (don't add the chocolate chips yet). Add the dry ingredients to the wet ingredients slowly until it's incorporated. Add the chocolate chips, or whatever you want, really!"
            },
            {
                "description": "Wrap the dough in plastic wrap and refrigerate for at least 30 minutes (It's worth it-- they come out in better shape and texture)."
            },
            {
                "description": "Drop in 1 tablespoon scoops on a cookie sheet lined with silpat or parchment paper. Bake at 350 for 8-9 minutes and DO NOT BAKE THEM FOR MORE THAN 10 MINUTES or you will regret it and be sad forever. They may look like they're not done, but they are! I promise!"
            },
            {
                "description": "Eat all you can, and if there are any left, store them in an airtight container for up to 10 days. I doubt they'll last that long!"
            }
        ]
    }
]