[
    {
        "title": " Mini Red Velvet Cupcakes  ",
        "yield": "36 adorably mini cupcakes",
        "time": "",
        "postId": 83,
        "ingredients": [
            {
                "amount": "1/2 cup",
                "name": "buttermilk (1/2 cup milk plus 1 tsp white vinegar)"
            },
            {
                "amount": "3/4 cup",
                "name": "vegetable oil"
            },
            {
                "amount": "1",
                "name": "egg"
            },
            {
                "amount": "1 tsp",
                "name": "red food coloring"
            },
            {
                "amount": "2 tsp",
                "name": "vanilla extract"
            },
            {
                "amount": "1 1/4 cups",
                "name": "all-purpose flour"
            },
            {
                "amount": "3/4 cup",
                "name": "granulated sugar"
            },
            {
                "amount": "1/2 tsp",
                "name": "baking soda"
            },
            {
                "amount": "1 1/2 tbsp",
                "name": "cocoa powder"
            },
            {
                "amount": "",
                "name": ""
            },
            {
                "amount": "",
                "name": "Best Ever Cream Cheese Frosting"
            },
            {
                "amount": "",
                "name": ""
            },
            {
                "amount": "1 (8 oz) block",
                "name": "cream cheese, slightly softened"
            },
            {
                "amount": "5 tbsp",
                "name": "butter (slightly softened-- pliable but not room temperature)"
            },
            {
                "amount": "2 tsp",
                "name": "vanilla extract"
            },
            {
                "amount": "2 cups",
                "name": "powdered sugar"
            }
        ],
        "steps": [
            {
                "description": "Preheat oven to 350 degrees fahrenheit. Line the mini muffin pans with 36 mini cupcake papers."
            },
            {
                "description": "Mix the buttermilk, vegetable oil, egg, food coloring, and vanilla extract with a hand mixer on the lowest setting until it's well incorporated."
            },
            {
                "description": "In a separate bowl, mix the flour, sugar, baking soda, and cocoa powder. Add the dry ingredients slowly to the wet ingredients with the hand mixer until there are no more lumps."
            },
            {
                "description": "Using a cookie scoop, scoop the batter into the mini cupcake papers, filling each one up almost 3/4 of the way up."
            },
            {
                "description": "Tap the filled muffin pans lightly on the counter a few times to get the bubbles out. Bake at 350 for 10 minutes, or until they bounce back up when you touch the top. (You can also test with a toothpick but I always just touch the top. If your finger leaves a dent, they're not ready.)"
            },
            {
                "description": "Using a hand mixer or stand mixer, combine the cream cheese and butter. Whip until it's light and fluffy. Add the vanilla and mix. Really slowly, add the powdered sugar while the mixer is going. Mix it until it's really smooth and fluffy."
            },
            {
                "description": "Tape the corner of a quart-sized bag (for reinforcement), then cut the corner off about 1/2 inch from the very tip. Insert a decorator's star tip. Add the frosting to the bag and decorate the cupcakes once they've cooled. Add sprinkles (because sprinkles make everything happier)."
            }
        ]
    }
]
