[
    {
        "title": "Oreo Cheesecake Bites  ",
        "yield": "about 50 cheesecake bites (It makes one 9x13 pan, so you can cut them however small or large you want to. I wanted them to go a long way)",
        "time": "",
        "postId": 84,
        "ingredients": [
            {
                "amount": "20",
                "name": "Oreos"
            },
            {
                "amount": "4 tbsp",
                "name": "butter, melted"
            },
            {
                "amount": "",
                "name": ""
            },
            {
                "amount": "3 8 oz packages",
                "name": "of cream cheese, room temperature"
            },
            {
                "amount": "1/2 cup",
                "name": "sugar"
            },
            {
                "amount": "3/4 cup",
                "name": "sour cream"
            },
            {
                "amount": "1 tsp",
                "name": "vanilla"
            },
            {
                "amount": "1/2 tsp",
                "name": "salt"
            },
            {
                "amount": "2",
                "name": "eggs plus 1 egg yolk"
            },
            {
                "amount": "16",
                "name": "Oreos"
            },
            {
                "amount": "",
                "name": ""
            },
            {
                "amount": "1/4 cup",
                "name": "white chocolate chips"
            },
            {
                "amount": "1 tbsp",
                "name": "vegetable oil"
            }
        ],
        "steps": [
            {
                "description": "Preheat oven to 325 degrees Fahrenheit."
            },
            {
                "description": "Line a 9x13 pan with parchment paper, leaving the parchment large enough to go up two of the sides  to allow for easier removal."
            },
            {
                "description": "Smash 20 Oreos to smithereens in a gallon ziplock. Add the melted butter and squish it all around. Make sure all of the Oreos have some of the butter on them so they stick together. Press the mixture into the pan. Bake for 10 minutes."
            },
            {
                "description": "Beat the cream cheese in a bowl until it's light and fluffy. Add the sugar and make sure it's completely incorporated. Add the sour cream, vanilla, and salt."
            },
            {
                "description": "Add the eggs and scrape down the bowl. Make sure everything is completely mixed with no chunks."
            },
            {
                "description": "Crush the remaining 16 Oreos (not completely smashed, just broken up into pieces). Gently stir them into the cream cheese mixture."
            },
            {
                "description": "Pour this onto the Oreo crust. Bake for 40 minutes, or until it's slightly jiggly in the center."
            },
            {
                "description": "Put it in the fridge for at least two hours. Run a knife around the edge and use the parchment paper to remove it from the pan. Cut into desired size (I did about 1.5x1.5). Make sure to wipe the knife on a paper towel between each cut."
            },
            {
                "description": "Melt the white chocolate and add a little bit of vegetable oil to smooth it out. Put it into a sandwich baggie and cut the very teeny tip off of the corner. Drizzle the chocolate on each square in a decorative pattern. Let the chocolate harden in the refrigerator for about 5 minutes. Enjoy!"
            }
        ]
    }
]
