[
    {
        "title": " Mini French Crullers  ",
        "yield": "about 15 donuts",
        "time": "",
        "postId": 96,
        "ingredients": [
            {
                "amount": "1 cup",
                "name": "water"
            },
            {
                "amount": "6 tbsps (3 oz.)",
                "name": "unsalted butter"
            },
            {
                "amount": "2 tsps (10 g)",
                "name": "sugar"
            },
            {
                "amount": "1/4 tsp",
                "name": "salt"
            },
            {
                "amount": "1 cup (135 g)",
                "name": "all-purpose flour"
            },
            {
                "amount": "3",
                "name": "large eggs"
            },
            {
                "amount": "2-3",
                "name": "egg whites, slightly beaten"
            },
            {
                "amount": "",
                "name": "oil for frying (I used peanut oil), about 2 inches up the pan"
            }
        ],
        "steps": [
            {
                "description": "Using heavy bottom pan, bring water, butter, sugar, and salt to a rapid boil over medium-high heat, stirring with a wooden spoon."
            },
            {
                "description": "Add flour, all at once, to the mixture. Stir rapidly to get flour clumps out. When a film begins to coat the bottom of the pan, turn heat off. You can see if a film is developing by scraping the bottom of the pan with the wooden spoon."
            },
            {
                "description": "Stir for a minute or two to cool it down. Add the whole eggs, one at a time, incorporating thoroughly in between eggs. Add the egg whites and make sure everything is fully incorporated."
            },
            {
                "description": "Turn the oil on to heat up. Put the dough into a gallon ziplock fastened with a 1/2 inch star tip. Cut 3\"x3\" parchment squares and butter each thoroughly."
            },
            {
                "description": "Pipe 2\"-3\" circles, making sure to barely overlap. If you overlap too much, they will be lopsided."
            },
            {
                "description": "Test a little piece of the dough to see if the oil is ready. If it is, gently place one of the squares dough-side down. The parchment paper will come off by itself. Take it out of the water with tongs (unless you just happen to love the interior decor of the Emergency Room- then you can use your hands). Flip the donut over when the bottom side seems golden brown enough."
            },
            {
                "description": "After frying both sides, take the donut out and place on paper towels. Dip in glaze, dust with powdered sugar, or eat plain!"
            },
            {
                "description": "Repeat step seven until you've gained 5 pounds."
            }
        ]
    }
]