[
    {
        "title": "Pastry Puffs  ",
        "yield": "about 60 medium-large puffs (small puffs can yield up to 100!)",
        "time": "",
        "postId": 98,
        "ingredients": [
            {
                "amount": "1 cup",
                "name": "water"
            },
            {
                "amount": "1/2 cup (1 stick)",
                "name": "unsalted butter"
            },
            {
                "amount": "1 tsp",
                "name": "sugar"
            },
            {
                "amount": "1 cup",
                "name": "all purpose flour"
            },
            {
                "amount": "4",
                "name": "large eggs"
            },
            {
                "amount": "",
                "name": ""
            },
            {
                "amount": "",
                "name": "gallon ziplocks"
            },
            {
                "amount": "1/4\" or 1/2\"",
                "name": "plain round tip"
            },
            {
                "amount": "",
                "name": "silpat (or parchment paper)"
            },
            {
                "amount": "",
                "name": "filling tip (something to push into the baked puffs)"
            }
        ],
        "steps": [
            {
                "description": "Preheat oven to 425 degrees fahrenheit. Line two cookie sheets with silpat (or parchment paper). Set aside."
            },
            {
                "description": "Place butter, water, and sugar into a small saucepan. Bring to a boil over medium-high heat."
            },
            {
                "description": "Immediately remove from heat. With a wooden spoon, stir in the flour. Continue to stir until the dough pulls away from the sides of the pan, about one minute. Let it cool for three minutes."
            },
            {
                "description": "Add eggs, one at a time, and stir with a wooden spoon until each egg is fully incorporated. Cut the very tiny tip off of a gallon ziplock. Transfer the dough into the ziplock."
            },
            {
                "description": "Pipe the dough into rounds about 1 1/4 inch in diameter. Wet your finger and smooth the pointy tops of the rounds."
            },
            {
                "description": "Bake 10 minutes. Reduce oven temperature to 350 degrees fahrenheit and bake for 25 more minutes, or until golden."
            },
            {
                "description": "Fill puffs with the filling tip with either fresh whipped cream, chocolate mousse, Nutella, or anything you desire! I would love to experiment more with flavored whipped creams, like raspberry whipped cream. Top with powdered sugar or chocolate sauce."
            }
        ]
    }
]